---
kind: other
id: Methods.T:Autodesk.Revit.DB.Category
source: html/476f8f53-bedb-80ab-f895-79ed8a4f60a8.htm
---
# Category Methods

Causes the object to release immediately any resources it may be utilizing.